docs/modules/graphing/freemacs-graphing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-07-07 Thu 12:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Graphing Configuration</title>
<meta name="author" content="Thomas Freeman" />
<meta name="description" content="This org-mode file contains an org-babel implementation of the .emacs or .emacs.d/init.el file." />
<meta name="keywords" content="Emacs" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../../init.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Graphing Configuration</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc07424b">1. Gnuplot</a></li>
<li><a href="#orgbbe4886">2. PlantUML</a>
<ul>
<li><a href="#org5107095">2.1. Install PlantUML Mode</a></li>
<li><a href="#orge701601">2.2. Set Location of PlantUML Binary</a></li>
</ul>
</li>
<li><a href="#org092f154">3. End</a></li>
</ul>
</div>
</div>



<div id="outline-container-orgc07424b" class="outline-2">
<h2 id="orgc07424b"><span class="section-number-2">1.</span> Gnuplot</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://github.com/emacs-gnuplot/gnuplot">Gnuplot</a> mode can be used for editing files that are used to define a plot style and layout and allow for execution of the code in an Emacs buffer.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">gnuplot</span>
  <span style="color: #1ea8fc;">:straight</span> t
  <span style="color: #1ea8fc;">:init</span>
  <span style="color: #ff2afc;">(</span>whicher <span style="color: #7984D1;">"gnuplot"</span><span style="color: #ff2afc;">)</span>
  <span style="color: #1ea8fc;">:defer</span> t<span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbbe4886" class="outline-2">
<h2 id="orgbbe4886"><span class="section-number-2">2.</span> PlantUML</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="https://plantuml.com/">PlantUML</a> is a language that can interpret code to create flowcharts and UML diagrams. The syntax is similar to programming languages thereby making it fast and easy to create accurate, auto-generated charts that don't require a lot of dragging boxes around as you might with a graphical tool such as LibreOffice Draw.
</p>
</div>

<div id="outline-container-org5107095" class="outline-3">
<h3 id="org5107095"><span class="section-number-3">2.1.</span> Install PlantUML Mode</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<a href="https://github.com/skuro/plantuml-mode">PlantUML mode</a> is not installed by default, so we need <code>use-package</code> to download and install it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">plantuml-mode</span>
  <span style="color: #1ea8fc;">:straight</span> t
  <span style="color: #1ea8fc;">:defer</span> t
  <span style="color: #1ea8fc;">:after</span> org<span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge701601" class="outline-3">
<h3 id="orge701601"><span class="section-number-3">2.2.</span> Set Location of PlantUML Binary</h3>
<div class="outline-text-3" id="text-2-2">
<p>
When Emacs is run as a portable app on a USB drive, Emacs needs to know the location of the PlantUML executable which I place in the .emacs.d directory.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>org-plantuml-jar-path <span style="color: #ff2afc;">(</span>expand-file-name <span style="color: #7984D1;">"~/.emacs.d/plantuml/plantuml.jar"</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org092f154" class="outline-2">
<h2 id="org092f154"><span class="section-number-2">3.</span> End</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">provide</span> '<span style="color: #df85ff; font-weight: bold;">freemacs-graphing</span><span style="color: #1ea8fc;">)</span>

<span style="color: #546A90;">;;; </span><span style="color: #546A90;">freemacs-graphing.el ends here</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Time-stamp: <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-07-07 Thu 12:43&gt;</span></span></p>
<p class="author">Author: Thomas Freeman</p>
<p class="date">Created: 2022-07-07 Thu 12:47</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
